Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/pads_qspi.h
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_BITS   _u(0x00000030)
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_MSB    _u(5)
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_LSB    _u(4)
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_ACCESS "RW"
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_VALUE_2MA _u(0x0)
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_VALUE_4MA _u(0x1)
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_VALUE_8MA _u(0x2)
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_VALUE_12MA _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PADS_QSPI_GPIO_QSPI_SS_PUE
// Description : Pull up enable
#define PADS_QSPI_GPIO_QSPI_SS_PUE_RESET  _u(0x1)
#define PADS_QSPI_GPIO_QSPI_SS_PUE_BITS   _u(0x00000008)
#define PADS_QSPI_GPIO_QSPI_SS_PUE_MSB    _u(3)
#define PADS_QSPI_GPIO_QSPI_SS_PUE_LSB    _u(3)
#define PADS_QSPI_GPIO_QSPI_SS_PUE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_QSPI_GPIO_QSPI_SS_PDE
// Description : Pull down enable
#define PADS_QSPI_GPIO_QSPI_SS_PDE_RESET  _u(0x0)
#define PADS_QSPI_GPIO_QSPI_SS_PDE_BITS   _u(0x00000004)
#define PADS_QSPI_GPIO_QSPI_SS_PDE_MSB    _u(2)
#define PADS_QSPI_GPIO_QSPI_SS_PDE_LSB    _u(2)
#define PADS_QSPI_GPIO_QSPI_SS_PDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_QSPI_GPIO_QSPI_SS_SCHMITT
// Description : Enable schmitt trigger
#define PADS_QSPI_GPIO_QSPI_SS_SCHMITT_RESET  _u(0x1)
#define PADS_QSPI_GPIO_QSPI_SS_SCHMITT_BITS   _u(0x00000002)
#define PADS_QSPI_GPIO_QSPI_SS_SCHMITT_MSB    _u(1)
#define PADS_QSPI_GPIO_QSPI_SS_SCHMITT_LSB    _u(1)
#define PADS_QSPI_GPIO_QSPI_SS_SCHMITT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PADS_QSPI_GPIO_QSPI_SS_SLEWFAST
// Description : Slew rate control. 1 = Fast, 0 = Slow
#define PADS_QSPI_GPIO_QSPI_SS_SLEWFAST_RESET  _u(0x0)
#define PADS_QSPI_GPIO_QSPI_SS_SLEWFAST_BITS   _u(0x00000001)
#define PADS_QSPI_GPIO_QSPI_SS_SLEWFAST_MSB    _u(0)
#define PADS_QSPI_GPIO_QSPI_SS_SLEWFAST_LSB    _u(0)
#define PADS_QSPI_GPIO_QSPI_SS_SLEWFAST_ACCESS "RW"
// =============================================================================
#endif // _HARDWARE_REGS_PADS_QSPI_H

